sunbeam0529/s32k_touch/Touch/slider.c
/****************************************************************************//*!
*
* @file  	slider.c
*
* @version  1.0.0.0
*
* @date     December-2017
*
* @brief    Slider electrode touch sense routines for S32K144
*
*******************************************************************************/

/*******************************************************************************
 * Includes
 *******************************************************************************/
#include "S32K118.h"
#include "ts_cfg.h"
#include "slider.h"
#include "gpio_inline_fcn2.h"
#include "filter.h"
#include "ets.h"

#if SLIDER_ENABLE
/*******************************************************************************
 * Variables
 ******************************************************************************/
// Touch qualification
uint8_t   sliderTouchQualified;
uint8_t	  sliderTouchQualifiedReport,sliderTouchQualifiedDisplay;
tBool hitHysteresis;
tBool positionDeciced;
tBool firstSliderTouch;
int8_t  positionCounter;
uint8_t thresholdNum;

// extern variables
extern int16_t   elecNumberOfSamples[NUMBER_OF_ELECTRODES];
extern int16_t   elecNumberOfSamplesActive[NUMBER_OF_ELECTRODES];
extern int32_t   elecRawData[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
extern int32_t   elecDCTrackerBuffer[NUMBER_OF_ELECTRODES];
extern uint8_t   elecDCTrackerShift[NUMBER_OF_ELECTRODES];
extern int32_t   elecDCTracker[NUMBER_OF_ELECTRODES];
extern int32_t   elecThresholdTouch[NUMBER_OF_ELECTRODES], elecThresholdRelease[NUMBER_OF_ELECTRODES];
extern int16_t   elecThresholdTouchDelta[NUMBER_OF_ELECTRODES], elecThresholdReleaseDelta[NUMBER_OF_ELECTRODES];
extern uint8_t   elecTouch[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
extern tFrac32   elecLPFilterData[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
extern uint8_t   firstSliderElecNum;
extern uint8_t   elecNum;
extern uint16_t   electrodeWakeUpActivateCounter;

// FrequencyHopping
extern uint8_t   frequencyID;

// Extern variables for slider electrode capacitance to equivalent voltage conversion

// Slider Touch qualification
// Slider data
int16_t sliderData;
int16_t sliderDiffData[NUMBER_OF_HOPPING_FREQUENCIES];
int16_t sliderSumData[NUMBER_OF_HOPPING_FREQUENCIES];
int16_t sliderSumLPFilterData[NUMBER_OF_HOPPING_FREQUENCIES];
int16_t sliderSumDataThreshold;
int16_t sliderStep;
int16_t sliderCentroidData[NUMBER_OF_HOPPING_FREQUENCIES];
tFrac32 sliderDiffLPFilterData[NUMBER_OF_HOPPING_FREQUENCIES];
tFrac32 sliderCentroidLPFilterData[NUMBER_OF_HOPPING_FREQUENCIES];

// Slider centroid filter buffer x(k-1), y(k-1)
extern tFrac32 FilterIIR1SliderDataBufferX[2][NUMBER_OF_HOPPING_FREQUENCIES], FilterIIR1SliderDataBufferY[2][NUMBER_OF_HOPPING_FREQUENCIES];

// Slider helper differential data thresholds for Freemaster
int16_t sliderDataThreshold[NUMBER_OF_THRESHOLDS_FREEMASTER + NUMBER_OF_SLIDER_THRESHOLDS] = {0};// PreInit to zero because of Freemaster
int16_t *sliderDataThresholdLast;

// Slider defines variables
int8_t numberOfHysteresisBlindPoints;

// Low power mode
extern uint8_t  lowPowerModeCtrl;

// FrequencyHopping
extern uint8_t   frequencyID,frequencyIDsave;
extern uint8_t   frequencyHoppingActivation;

// Decimation filter
extern int32_t   elecRawDataDF[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];

// Oversampling
uint8_t sliderOversamplingActivationReport;


/*****************************************************************************
 *
 * Function: void SliderVarInit (void)
 *
 * Description: Init slider specific variables
 *
 *****************************************************************************/
void SliderVarInit(void)
{
	// Reset slider First touch indicator
	firstSliderTouch = TRUE;

	// Get default number of hysteresis blind points
	numberOfHysteresisBlindPoints = NUMBER_OF_HYSTERESIS_BLIND_POINTS;

	// Set the default slider addition data threshold of y-direction false touch canceling
	sliderSumDataThreshold = SLIDER_SUM_THRESHOLD;

	// Varying last difference threshold pointer assignment
	sliderDataThresholdLast = &sliderDataThreshold[NUMBER_OF_SLIDER_THRESHOLDS-1];

}
/*****************************************************************************
 *
 * Function: void Slider2PadsElectrodesSort(uint8_t electrodeNum, uint8_t* electrodeNumFirstPtr, uint8_t* electrodeNumSecondPtr)
 *
 * Description: Determine which electrode form slider electrode pair is first
 *
 * Note I: This function is suitable for slider consisting of 2 electrodes only
 *
 *****************************************************************************/
void Slider2PadsElectrodesSort(uint8_t electrodeNum, uint8_t* electrodeNumFirstPtr, uint8_t* electrodeNumSecondPtr)
{
	if (firstSliderElecNum % 2 == 0)// Is the total first electrode even numbered one?
	{
		// Decide which electrode of the 2  electrodes  is to be served
		if(electrodeNum % 2 == 0) // Is it the first one (even numbered one)?
		{
			// electrodeNum is even nembered electrode
			*electrodeNumFirstPtr = electrodeNum;
			*electrodeNumSecondPtr = electrodeNum + 1;
		}
		else if(electrodeNum % 2 == 1)// Is it the second one (odd numbered one)?
		{
			// electrodeNum is odd numbered electrode
			*electrodeNumFirstPtr = electrodeNum - 1;
			*electrodeNumSecondPtr = electrodeNum;
		}
	}
	else
	{
		// Decide which electrode of the 2  electrodes is to be served
		if(electrodeNum % 2 == 0) // Is it the first one (even numbered one)?
		{
			// electrodeNum is even nembered electrode
			*electrodeNumFirstPtr = electrodeNum - 1;
			*electrodeNumSecondPtr = electrodeNum;
		}
		else if(electrodeNum % 2 == 1)// Is it the second one (odd numbered one)?
		{
			// electrodeNum is odd numbered electrode
			*electrodeNumFirstPtr = electrodeNum;
			*electrodeNumSecondPtr = electrodeNum + 1;
		}
	}
}
/*****************************************************************************
 *
 * Function: void SliderSingleElecDSP(uint8_t electrodeNum)
 *
 * Description: Process raw data for single slider electrode
 *
 * Note I: This function is suitable for slider consisting of 2 electrodes only
 *
 *****************************************************************************/
void Slider2PadsElecDSP(uint8_t electrodeNum)
{
	uint8_t electrodeNumFirst, electrodeNumSecond;

	// Determine if the electrode served is first or second from the 2 slider electrodes
	Slider2PadsElectrodesSort(electrodeNum, &electrodeNumFirst, &electrodeNumSecond);

	// Update DC Tracker, if both electrodes not touched
	if (elecTouch[electrodeNumFirst][frequencyID] < 1 && elecTouch[electrodeNumSecond][frequencyID] < 1)
	{
		// Update DC Tracker
		ElecDCTrackerUpdate(electrodeNum);
	}

#if DECIMATION_FILTER
	// Decimation filtering
	DecimationFilter(electrodeNum);
#endif
	// Calculate the relative touch threshold of the electrode
	elecThresholdTouch[electrodeNum] = elecDCTracker[electrodeNum] - elecThresholdTouchDelta[electrodeNum];
	elecThresholdRelease[electrodeNum] = elecDCTracker[electrodeNum] - elecThresholdReleaseDelta[electrodeNum];

#if DECIMATION_FILTER
	// Filter Slider electrode DF signal using IIR LP filter
	elecLPFilterData[electrodeNum][frequencyID] = FilterIIR1(electrodeNum, (tFrac32)(elecRawDataDF[electrodeNum][frequencyID]), frequencyID);
#else
	// Filter Slider electrode raw signal using IIR LP filter
	elecLPFilterData[electrodeNum][frequencyID] = FilterIIR1(electrodeNum, (tFrac32)(elecRawData[electrodeNum][frequencyID]), frequencyID);
#endif

