sunbeam0529/s32k_touch/Touch/slider.c
}


/*****************************************************************************
*
* Function: void Slider2PadsElecTouchDetect(uint8_t electrodeNum)
*
* Description: Detect slider electrode touch
*
* Note I: This function is suitable for slider consisting of 2 electrodes only
*
*****************************************************************************/
void Slider2PadsElecTouchDetect(uint8_t electrodeNum)
{
	// Slider electrode touched ? z-axis touch detection
	if (elecLPFilterData[electrodeNum][frequencyID] < elecThresholdTouch[electrodeNum])

	{
		// y-axis touch confirmation
		if (sliderSumLPFilterData[frequencyID] < sliderSumDataThreshold)
		{
			// Report touch detected and confirmed
			elecTouch[electrodeNum][frequencyID] = 2;

			// Load counter to do not return to the wake-up function
			// Do not return to the wake-up function, when electrode released and electrode signal value is above touch and bellow release threshold
			// Expected SR <= 1s
			electrodeWakeUpActivateCounter = ELEC_WAKEUP_ACTIVATE_COUNTER;

		}
		else
		{
			// Report touch detected, but not confirmed
			elecTouch[electrodeNum][frequencyID] = 1;
		}
	}
	// Electrode released?
	//else
	else if ((elecLPFilterData[electrodeNum][frequencyID] > elecThresholdRelease[electrodeNum]) && (elecTouch[electrodeNum][frequencyID] > 0))
	{
		// Report released
		elecTouch[electrodeNum][frequencyID] = 0;
	}

	// Fast release detection
	// Previously touched elec Electrode FAST RELEASED? z-axis touch detection
	if (elecTouch[electrodeNum][frequencyID] > 0)
	{
		// Slider electrode raw data risen above touch threshold?
		if (elecRawData[electrodeNum][frequencyID] > elecThresholdTouch[electrodeNum] || sliderSumData[frequencyID] > sliderSumDataThreshold)
		{
			// Report released
			elecTouch[electrodeNum][frequencyID] = 0;
		}
	}
}


/*****************************************************************************
 *
 * Function: void Slider2PadsSumDataCalculation(void)
 *
 * Description: Calculate slider sum data (el0-el1 etc.)
 *
 * Note I: This function is suitable for slider consisting of 2 electrodes only
 *
 *****************************************************************************/
void Slider2PadsSumDataCalculation(void)
{
	for (uint8_t electrodeNum = firstSliderElecNum; electrodeNum < (firstSliderElecNum + NUMBER_OF_SLIDER_ELECTRODES); electrodeNum = electrodeNum + NUMBER_OF_ELECTRODES_PER_SLIDER)
	{
	// Sum
	// Add the raw data of both electrodes, normalize them with respect to their different baselines
	sliderSumData[frequencyID] = (elecRawData[electrodeNum][frequencyID] + elecRawData[electrodeNum+1][frequencyID]) - (elecDCTracker[electrodeNum] + elecDCTracker[electrodeNum+1]);
	// Filter the sum data with 5Hz LPF IIR
	sliderSumLPFilterData[frequencyID] = FilterIIR1SliderData((tFrac32) sliderSumData[frequencyID], 0, frequencyID);
	}
}

#if (SLIDER_DATA_CALC_METHOD == DIFFERENCE_DATA)
/*****************************************************************************
 *
 * Function: int16_t Slider2PadsDiffDataCalculation(uint8_t freq)
 *
 * Description: Calculate slider difference data (el0-el1 etc.)
 *
 * Note I: This function is suitable for slider consisting of 2 electrodes only
 *
 *****************************************************************************/
int16_t Slider2PadsDiffDataCalculation(uint8_t freq)
{
	for (uint8_t electrodeNum = firstSliderElecNum; electrodeNum < (firstSliderElecNum + NUMBER_OF_SLIDER_ELECTRODES); electrodeNum = electrodeNum + NUMBER_OF_ELECTRODES_PER_SLIDER)
	{
	// Difference data
	// Subtract the raw data from each other, normalize them with respect to their different baselines
	sliderDiffData[freq] = (elecRawData[electrodeNum][freq] - elecRawData[electrodeNum+1][freq]) - (elecDCTracker[electrodeNum] - elecDCTracker[electrodeNum+1]);

	// Has slider been already touched?
	if (sliderTouchQualified > 0)
	{
		// Filter the diff data with 5Hz LPF IIR
		sliderDiffLPFilterData[freq] = FilterIIR1SliderData((tFrac32) sliderDiffData[freq], 1, freq);
	}
	else
	{
		// Init centroid IIR filter buffer
		FilterIIR1SliderDataBufferX[1][freq] = (tFrac32)sliderDiffData[freq]<< IIR_FILTER_VALUE_SHIFT;
		FilterIIR1SliderDataBufferY[1][freq] = (tFrac32)sliderDiffData[freq]<< IIR_FILTER_VALUE_SHIFT;

		// Set raw data as filtered for quick response
		sliderDiffLPFilterData[freq] = (tFrac32) sliderDiffData[freq];
	}


	}

	return sliderDiffLPFilterData[freq];
}
#endif

#if (SLIDER_DATA_CALC_METHOD == CENTROID)
/*****************************************************************************
 *
 * Function: int16_t Slider2PadsCentroidDataCalculation(uint8_t freq)
 *
 * Description: Calculate slider centroid data (el0-el1 etc.)
 *
 * Note I: This function is suitable for slider consisting of 2 electrodes only
 *
 *****************************************************************************/
int16_t Slider2PadsCentroidDataCalculation(uint8_t freq)
{
	for (uint8_t electrodeNum = firstSliderElecNum; electrodeNum < (firstSliderElecNum + NUMBER_OF_SLIDER_ELECTRODES); electrodeNum = electrodeNum + NUMBER_OF_ELECTRODES_PER_SLIDER)
	{
		int16_t centroid;

		// Centroid data = ((((elec0Num+1)*elec0Drop+(elec1Num+1)*elec1drop)/(elec0drop+elec1drop))*resolution)-resolution
		centroid = (int16_t) ((tFloat) (((1*(elecRawData[electrodeNum][freq]-elecDCTracker[electrodeNum]))+(2*(elecRawData[electrodeNum+1][freq]-elecDCTracker[electrodeNum+1]))))/((tFloat) (sliderSumData[freq]))*(SLIDER_CENTROID_RESOLUTION));
		centroid = centroid - SLIDER_CENTROID_RESOLUTION;

		// Correction
		if (centroid >= 0 && centroid <= SLIDER_CENTROID_RESOLUTION)
		{
			sliderCentroidData[freq] = (tFrac32) centroid;
		}

		// Has slider been already touched?
		if (sliderTouchQualified > 0)
		{
			// Filter the centroid data with 5Hz LPF IIR
			sliderCentroidLPFilterData[freq] = FilterIIR1SliderData((tFrac32) sliderCentroidData[freq], 1, freq);

		}
		else
		{
			// Init centroid IIR filter buffer
			FilterIIR1SliderDataBufferX[1][freq] = (tFrac32)sliderCentroidData[freq]<< IIR_FILTER_VALUE_SHIFT;
			FilterIIR1SliderDataBufferY[1][freq] = (tFrac32)sliderCentroidData[freq]<< IIR_FILTER_VALUE_SHIFT;

			// Set raw data as filtered for quick response
			sliderCentroidLPFilterData[freq] = (tFrac32) sliderCentroidData[freq];
		}

