sunbeam0529/s32k_touch/Touch/slider.c
	}

	return sliderCentroidLPFilterData[freq];
}
#endif
/*****************************************************************************
 *
 * Function: void Slider2PadsTouchQualify(void)
 *
 * Description: Qualification of the slider touch event when using the differential data = ((el0-el1)-(el1-el0))
 *
 * Note I: This function is suitable for slider consisting of 2 electrodes only
 *
 *****************************************************************************/
void Slider2PadsTouchQualify(void)
{
	uint8_t f_count, freq;
	int16_t sliderDataTemp = 0;

	for (elecNum = firstSliderElecNum; elecNum < (firstSliderElecNum + NUMBER_OF_SLIDER_ELECTRODES); elecNum = elecNum + NUMBER_OF_ELECTRODES_PER_SLIDER)
	{
#if FREQUENCY_HOPPING
		// Reset frequency count
		f_count = 0;

		for (freq = 0; freq < NUMBER_OF_HOPPING_FREQUENCIES; freq++)
		{
			// At least one of the slider electrodes reported as touched AND the number of samples per cycle has been risen (from previous mcu duty cycle)
			if((elecTouch[elecNum][freq] > 1 || elecTouch[elecNum+1][freq] > 1) &&
					elecNumberOfSamples[elecNum] == elecNumberOfSamplesActive[elecNum])
			{
				f_count++;
			}
		}

		// Electrode has been touched on all frequencies?
		if (f_count == NUMBER_OF_HOPPING_FREQUENCIES)
#else
			// At least one of the slider electrodes reported as touched AND the number of samples per cycle has been risen (from previous mcu duty cycle)
			if ((elecTouch[elecNum][frequencyID] > 1 || elecTouch[elecNum+1][frequencyID] > 1) &&
					elecNumberOfSamples[elecNum] == elecNumberOfSamplesActive[elecNum])
#endif
			{
				// Report slider electrode touch for flextimer for background lightning, prevent entry to VLPS
				sliderTouchQualifiedReport = 1;
				// Reset  positionCounter of the slider RGB lights
				positionCounter = 1;
				// Set hysteresis detection to false
				hitHysteresis = FALSE;
				// Set decided position to false
				positionDeciced = FALSE;

				// Based on chosen slider calculation method
#if (SLIDER_DATA_CALC_METHOD == CENTROID)

				for (freq = 0; freq < NUMBER_OF_HOPPING_FREQUENCIES; freq++)
				{
					//Calculate Centroid for each freq
					sliderDataTemp += Slider2PadsCentroidDataCalculation(freq);
				}

				// Slider step recalculation
				sliderStep = (SLIDER_CENTROID_RESOLUTION*SLIDER_CENTROID_RESOLUTION_PCT/100) / NUMBER_OF_SLIDER_SEGMENTS;

				// Recalculate slider thresholds
				for(thresholdNum = 0; thresholdNum < NUMBER_OF_SLIDER_THRESHOLDS; thresholdNum++)
				{
					sliderDataThreshold[thresholdNum] = sliderStep*(thresholdNum+1) + (SLIDER_CENTROID_RESOLUTION - SLIDER_CENTROID_RESOLUTION*SLIDER_CENTROID_RESOLUTION_PCT/100)/2;
				}

#else
				int16_t sliderSumDataAvg = 0;

				for (uint8_t freq = 0; freq < NUMBER_OF_HOPPING_FREQUENCIES; freq++)
				{
					// Calculate Difference data for each freq
					sliderDataTemp += Slider2PadsDiffDataCalculation(freq);
					sliderSumDataAvg += sliderSumData[freq];
				}

				// Slider step recalculation
				sliderSumDataAvg = sliderSumDataAvg/NUMBER_OF_HOPPING_FREQUENCIES;

				sliderStep = sliderSumDataAvg/NUMBER_OF_SLIDER_SEGMENTS;

				// Recalculate slider thresholds - adaptive thresholds
				for(thresholdNum = 0; thresholdNum < NUMBER_OF_SLIDER_THRESHOLDS; thresholdNum++)
				{
					sliderDataThreshold[NUMBER_OF_SLIDER_THRESHOLDS-1-thresholdNum]=(sliderSumDataAvg/2)-sliderStep*(NUMBER_OF_SLIDER_THRESHOLDS-thresholdNum);
				}
#endif

				// Make avarage of the slider data from all frequencies
				sliderData = sliderDataTemp/NUMBER_OF_HOPPING_FREQUENCIES;
				// Decide the position of finger based on thresholds in cfg
				// At least one threshold defined in cfg?
#if (NUMBER_OF_SLIDER_THRESHOLDS > 0)

				// Are the data below the first threshold - threshold[0]?
				if (sliderData < sliderDataThreshold[0])
				{
					// Check if the data had hit the hysteresis interval below the first threshold
					if (sliderData > (sliderDataThreshold[0] - numberOfHysteresisBlindPoints))
					{
						// Is this a first touch of the slider? -> qualify the position anyway
						if(firstSliderTouch == TRUE)
						{
							sliderTouchQualified = positionCounter;
							positionDeciced = TRUE;
							firstSliderTouch = FALSE;
						}

						else
							// It hit the blind hysteresis interval and the first touch has already been done - set hitHysteresis True
							hitHysteresis = TRUE;
					}

					// Else qualify the position on slider
					else
					{
						sliderTouchQualified = positionCounter;
						positionDeciced = TRUE;
						firstSliderTouch = FALSE;
					}
				}

#if (NUMBER_OF_SLIDER_THRESHOLDS > 1)// More than one threshold defined in cfg?

				// Are the data somewhere between the threshold[0] and the last threshold then?
				else if((sliderData >= sliderDataThreshold[0]) &&
						(sliderData < *sliderDataThresholdLast))
				{

					// For cycle to determine the position across the thresholds - between the threshold[0] and the last threshold
					for(thresholdNum = 0; thresholdNum<NUMBER_OF_SLIDER_THRESHOLDS; thresholdNum++)
					{
						// Increase the  positionCounter of the RGB lights by one
						positionCounter++;

						if (sliderData >= sliderDataThreshold[thresholdNum] &&
								sliderData < sliderDataThreshold[thresholdNum+1])
						{
							// Now check if the data had hit the top or bottom hysteresis interval within the e.g first and e.g second threshold (under first and above second threshold)
							if (sliderData > (sliderDataThreshold[thresholdNum] + numberOfHysteresisBlindPoints) &&
									sliderData < (sliderDataThreshold[thresholdNum+1] - numberOfHysteresisBlindPoints))
							{
								// The data are in the active area = between the hysteresis intervals - thus qualify the position on slider
								sliderTouchQualified = positionCounter;
								positionDeciced = TRUE;
								firstSliderTouch = FALSE;
							}

							else
							{
								// Is this a first touch of the slider? -> qualify the position anyway
								if(firstSliderTouch == TRUE)
								{
									sliderTouchQualified = positionCounter;
									positionDeciced = TRUE;
									firstSliderTouch = FALSE;
								}

								else
									// It hit the blind hysteresis interval and the first touch has already been done - set hitHysteresis True
									hitHysteresis = TRUE;
							}

							// Exit for cycle
							break;
						}
					}
				}

#endif
				// The data did not fit between any thresholds - are the data above the last threshold?
				else
				{
					// Check if the data were previously marked as within hysteresis interval
					if(hitHysteresis == TRUE || positionDeciced == TRUE)
					{
						// Do not change the sliderTouchQualified
					}

