sunbeam0529/s32k_touch/Touch/slider.c
					// Check for hysteresis above the last threshold (similar principle as checking for hysteresis below the first threshold)
					else
					{
						if(sliderData >= *sliderDataThresholdLast &&
								sliderData < (*sliderDataThresholdLast + numberOfHysteresisBlindPoints))
						{
							// Is this a first touch of the slider? -> qualify the position anyway as the highest
							if(firstSliderTouch == TRUE)
							{
								sliderTouchQualified = NUMBER_OF_SLIDER_SEGMENTS;
								positionDeciced = TRUE;
								firstSliderTouch = FALSE;
							}

							else
								// It hit the blind hysteresis interval and the first touch has already been done - set hitHysteresis True
								hitHysteresis = TRUE;

						}

						// The data were not within the hysteresis interval
						else
						{
							// Qualify the position on slider as the highest
							sliderTouchQualified = NUMBER_OF_SLIDER_SEGMENTS;
							positionDeciced = TRUE;
							firstSliderTouch = FALSE;
						}
					}
				}
#endif

			}

		// Else no touch?
			else
			{
				{
					// Report slider electrode release for flextimer for background lightning and for jumping to VLPS
					sliderTouchQualifiedReport = 0;

					// Report no slider qualified touch
					sliderTouchQualified = 0;

					// Reset the firstSliderTouch variable
					firstSliderTouch = TRUE;
				}
			}
	}
}

/*****************************************************************************
 *
 * Function: uint8_t Slider_RGBLED_Ctrl(void)
 *
 * Description: Display slider touch event
 *
 *****************************************************************************/
uint8_t Slider_RGBLED_Ctrl(void)
{

	// SLIDER RGB
	// No touch event
	sliderTouchQualifiedDisplay = 0;

	// Search for touch event
	// Slider Electrode touched?
	if (sliderTouchQualified > 0)
	{
		// Load slider electrode finger position
		sliderTouchQualifiedDisplay = sliderTouchQualified;
	}

	// Display slider touch event
	switch(sliderTouchQualifiedDisplay)
	{

	case 0:// Slider electrode not touched - no light
	{

		break;
	}
	case 1:// Slider electrodes touched, sliderDifferenceDataDouble < sliderDiffThreshold[0] - white
	{
		// Turn ON RED LED
		LedRedON();
		// Turn ON GREEN LED
		LedGreenON();
		// Turn ON BLUE LED
		LedBlueON();

		break;
	}

	case 2:// Slider electrodes touched, sliderDiffThreshold[0] < sliderDifferenceDataDouble < sliderDiffThreshold[1]- red
	{
		// Turn ON RED LED
		LedRedON();
		// Turn OFF GREEN LED
		LedGreenOFF();
		// Turn OFF BLUE LED
		LedBlueOFF();

		break;
	}



	case 3:// Slider electrodes touched, sliderDiffThreshold[1] < sliderDifferenceDataDouble < sliderDiffThreshold[2] - yellow
	{
		// Turn ON RED LED
		LedRedON();
		// Turn ON GREEN LED
		LedGreenON();
		// Turn OFF BLUE LED
		LedBlueOFF();

		break;
	}



	case 4:// Slider electrodes touched, sliderDiffThreshold[2]  < sliderDifferenceDataDouble < sliderDiffThreshold[3] - green
	{
		// Turn OFF RED LED
		LedRedOFF();
		// Turn ON GREEN LED
		LedGreenON();
		// Turn OFF BLUE LED
		LedBlueOFF();

		break;
	}



	case 5:// Slider electrodes touched, sliderDiffThreshold[3] < sliderDifferenceDataDouble < sliderDiffThreshold[4] - blue
	{
		// Turn OFF RED LED
		LedRedOFF();
		// Turn OFF GREEN LED
		LedGreenOFF();
		// Turn ON BLUE LED
		LedBlueON();

		break;
	}



	case 6:// Slider electrodes touched, sliderDiffThreshold[4] < sliderDifferenceDataDouble < sliderDiffThreshold[5] - purple
	{
		// Turn ON RED LED
		LedRedON();
		// Turn OFF GREEN LED
		LedGreenOFF();
		// Turn ON BLUE LED
		LedBlueON();

		break;
	}

	case 7:// Slider electrodes touched, sliderDiffThreshold[5] < sliderDifferenceDataDouble < sliderDiffThreshold[6] - azure
	{
		// Turn OFF RED LED
		LedRedOFF();
		// Turn ON GREEN LED
		LedGreenON();
		// Turn ON BLUE LED
		LedBlueON();

		break;
	}
	case 8:// Slider electrodes touched, sliderDifferenceDataDouble > sliderDiffThreshold[6] - white again
	{
		// Turn ON RED LED
		LedRedON();
		// Turn ON GREEN LED
		LedGreenON();
		// Turn ON BLUE LED
		LedBlueON();

		break;
	}

	}

	return sliderTouchQualifiedDisplay;
}

// Slider enable
#endif
